README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-04 Sat 00:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algorithms &amp; Data Structures with Rust</title>
<meta name="author" content="Dang Quang Vu" />
<meta name="description" content="The journey to become supper rust coder" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Algorithms &amp; Data Structures with Rust</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2589ced">1. Recursion</a>
<ul>
<li><a href="#org162804b">1.1. Linear Recursion</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2589ced" class="outline-2">
<h2 id="org2589ced"><span class="section-number-2">1.</span> Recursion</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Recursion is a programming concept where a function calls itself repeatedly until a certain condition is met. In other words, it's a technique where a function solves a problem by calling it self as a subroutine.</li>
</ul>
</div>
<div id="outline-container-org162804b" class="outline-3">
<h3 id="org162804b"><span class="section-number-3">1.1.</span> Linear Recursion</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Linear recursion is a type of recursion where each function call results in exactly one recursive call. In other words, the function calls itself.</li>
</ul>
<div class="org-src-container">
<pre class="src src-rustic"><span style="color: #FF6188;">fn</span> <span style="color: #A9DC76;">linear_recursion</span><span style="color: #AB9DF2; background-color: #2D2A2E;">(</span><span style="color: #FCFCFA;">n</span>: <span style="color: #78DCE8;">usize</span><span style="color: #AB9DF2; background-color: #2D2A2E;">)</span> -&gt; <span style="color: #78DCE8;">usize</span> <span style="color: #AB9DF2;">{</span>
    <span style="color: #FF6188;">if</span> n <span style="color: #FF6188;">==</span> <span style="color: #78DCE8;">0</span> <span style="color: #78DCE8;">{</span>
        <span style="color: #FF6188;">return</span> <span style="color: #78DCE8;">1</span><span style="color: #FCFCFA; background-color: #2D2A2E;">;</span>
    <span style="color: #78DCE8;">}</span>
    n <span style="color: #FF6188;">*</span> <span style="color: #FCFCFA; font-weight: bold;">linear_recursion</span><span style="color: #78DCE8; background-color: #2D2A2E;">(</span>n <span style="color: #FF6188;">-</span> <span style="color: #78DCE8;">1</span><span style="color: #78DCE8; background-color: #2D2A2E;">)</span>
<span style="color: #AB9DF2;">}</span>

<span style="color: #FF6188;">fn</span> <span style="color: #A9DC76;">fibonacci</span><span style="color: #AB9DF2; background-color: #2D2A2E;">(</span><span style="color: #FCFCFA;">n</span>: <span style="color: #78DCE8;">usize</span><span style="color: #AB9DF2; background-color: #2D2A2E;">)</span> -&gt; <span style="color: #78DCE8;">usize</span> <span style="color: #AB9DF2;">{</span>
    <span style="color: #FF6188;">match</span> n <span style="color: #78DCE8;">{</span>
        <span style="color: #78DCE8;">0</span> =&gt; <span style="color: #78DCE8;">0</span>,
        <span style="color: #78DCE8;">1</span> =&gt; <span style="color: #78DCE8;">1</span>,
        _ =&gt; <span style="color: #FCFCFA; font-weight: bold;">fibonacci</span><span style="color: #FC9867; background-color: #2D2A2E;">(</span>n <span style="color: #FF6188;">-</span> <span style="color: #78DCE8;">1</span><span style="color: #FC9867; background-color: #2D2A2E;">)</span> <span style="color: #FF6188;">+</span> <span style="color: #FCFCFA; font-weight: bold;">fibonacci</span><span style="color: #FC9867; background-color: #2D2A2E;">(</span>n <span style="color: #FF6188;">-</span> <span style="color: #78DCE8;">2</span><span style="color: #FC9867; background-color: #2D2A2E;">)</span>,
    <span style="color: #78DCE8;">}</span>
<span style="color: #AB9DF2;">}</span>

<span style="color: #FF6188;">fn</span> <span style="color: #A9DC76;">fibonacci_array</span><span style="color: #AB9DF2; background-color: #2D2A2E;">(</span><span style="color: #FCFCFA;">n</span>: <span style="color: #78DCE8;">usize</span><span style="color: #AB9DF2; background-color: #2D2A2E;">)</span> -&gt; <span style="color: #78DCE8;">Vec</span><span style="color: #AB9DF2; background-color: #2D2A2E;">&lt;</span><span style="color: #78DCE8;">i32</span><span style="color: #AB9DF2; background-color: #2D2A2E;">&gt;</span> <span style="color: #AB9DF2;">{</span>
    <span style="color: #FF6188;">let</span> <span style="color: #FF6188;">mut</span> <span style="color: #FCFCFA;">fibo</span>: <span style="color: #78DCE8;">Vec</span><span style="color: #78DCE8; background-color: #2D2A2E;">&lt;</span><span style="color: #78DCE8;">i32</span><span style="color: #78DCE8; background-color: #2D2A2E;">&gt;</span> <span style="color: #FF6188;">=</span> <span style="color: #78DCE8;">Vec</span><span style="color: #FCFCFA; background-color: #2D2A2E;">::</span><span style="color: #FCFCFA; font-weight: bold;">with_capacity</span><span style="color: #78DCE8; background-color: #2D2A2E;">(</span>n<span style="color: #78DCE8; background-color: #2D2A2E;">)</span><span style="color: #FCFCFA; background-color: #2D2A2E;">;</span>

    <span style="color: #FF6188;">for</span> <span style="color: #FCFCFA;">i</span> <span style="color: #FF6188;">in</span> <span style="color: #78DCE8;">0</span>..n <span style="color: #78DCE8;">{</span>
        <span style="color: #FF6188;">match</span> i <span style="color: #FC9867;">{</span>
            <span style="color: #78DCE8;">0</span> =&gt; fibo<span style="color: #FCFCFA; background-color: #2D2A2E;">.</span><span style="color: #FCFCFA; font-weight: bold; font-style: italic;">push</span><span style="color: #A9DC76; background-color: #2D2A2E;">(</span><span style="color: #78DCE8;">0</span><span style="color: #A9DC76; background-color: #2D2A2E;">)</span>,
            <span style="color: #78DCE8;">1</span> =&gt; fibo<span style="color: #FCFCFA; background-color: #2D2A2E;">.</span><span style="color: #FCFCFA; font-weight: bold; font-style: italic;">push</span><span style="color: #A9DC76; background-color: #2D2A2E;">(</span><span style="color: #78DCE8;">1</span><span style="color: #A9DC76; background-color: #2D2A2E;">)</span>,
            _ =&gt; <span style="color: #A9DC76;">{</span>
                <span style="color: #FF6188;">let</span> <span style="color: #FCFCFA;">fib_iter</span> <span style="color: #FF6188;">=</span> fibo<span style="color: #AB9DF2; background-color: #2D2A2E;">[</span>i <span style="color: #FF6188;">-</span> <span style="color: #78DCE8;">1</span><span style="color: #AB9DF2; background-color: #2D2A2E;">]</span> <span style="color: #FF6188;">+</span> fibo<span style="color: #AB9DF2; background-color: #2D2A2E;">[</span>i <span style="color: #FF6188;">-</span> <span style="color: #78DCE8;">2</span><span style="color: #AB9DF2; background-color: #2D2A2E;">]</span><span style="color: #FCFCFA; background-color: #2D2A2E;">;</span>
                fibo<span style="color: #FCFCFA; background-color: #2D2A2E;">.</span><span style="color: #FCFCFA; font-weight: bold; font-style: italic;">push</span><span style="color: #AB9DF2; background-color: #2D2A2E;">(</span>fib_iter<span style="color: #AB9DF2; background-color: #2D2A2E;">)</span>
            <span style="color: #A9DC76;">}</span>
        <span style="color: #FC9867;">}</span>
    <span style="color: #78DCE8;">}</span>
    fibo
<span style="color: #AB9DF2;">}</span>

<span style="color: #FF6188;">fn</span> <span style="color: #A9DC76;">main</span><span style="color: #AB9DF2; background-color: #2D2A2E;">()</span> <span style="color: #AB9DF2;">{</span>
    <span style="color: #FF6188; font-weight: bold;">println!</span><span style="color: #78DCE8; background-color: #2D2A2E;">(</span><span style="color: #FFD866;">"Linear Recursion: {:?}"</span>,linear_recursion<span style="color: #FC9867; background-color: #2D2A2E;">(</span><span style="color: #78DCE8;">5</span><span style="color: #FC9867; background-color: #2D2A2E;">)</span><span style="color: #78DCE8; background-color: #2D2A2E;">)</span><span style="color: #FCFCFA; background-color: #2D2A2E;">;</span>
    <span style="color: #FF6188; font-weight: bold;">println!</span><span style="color: #78DCE8; background-color: #2D2A2E;">(</span><span style="color: #FFD866;">"Fibonacci Number :{:?}"</span>,fibonacci<span style="color: #FC9867; background-color: #2D2A2E;">(</span><span style="color: #78DCE8;">10</span><span style="color: #FC9867; background-color: #2D2A2E;">)</span><span style="color: #78DCE8; background-color: #2D2A2E;">)</span><span style="color: #FCFCFA; background-color: #2D2A2E;">;</span>
    <span style="color: #FF6188; font-weight: bold;">println!</span><span style="color: #78DCE8; background-color: #2D2A2E;">(</span><span style="color: #FFD866;">"Fibonacci Array :{:?}"</span>,fibonacci_array<span style="color: #FC9867; background-color: #2D2A2E;">(</span><span style="color: #78DCE8;">11</span><span style="color: #FC9867; background-color: #2D2A2E;">)</span><span style="color: #78DCE8; background-color: #2D2A2E;">)</span><span style="color: #FCFCFA; background-color: #2D2A2E;">;</span>
<span style="color: #AB9DF2;">}</span>
</pre>
</div>

<pre class="example">
Linear Recursion: 120
Fibonacci Number :55
Fibonacci Array :[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dang Quang Vu</p>
<p class="date">Created: 2023-03-04 Sat 00:14</p>
</div>
</body>
</html>